Revit 2027 API
StairsRun.GetRightSupports Method
 Retrieves all supports on the right side of run boundaries.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetRightSupports()
Public Function GetRightSupports As IList(Of ElementId)
public:
IList<ElementId^>^ GetRightSupports()
member GetRightSupports : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The supports on the right side of run boundaries.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace